package student_artem_aleksandrov.lesson5.level6;

/*
    Создайте в классе ArrayUtil метод для
распечатки массива целых чисел на консоль.

class ArrayUtil {

    public void printArrayToConsole(int[] array) {
        // Напишите реализацию !!!
    }

}
 */

class ArrayUtil {
    public void printArrayToConsole(int[] array) {
        for (int i:array) {
            System.out.println(i);
        }

    }
}
